Catalogs/ЛБ_Тара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_Тара</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДейстующаяТара</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ЛБ_Тара/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
			Объект.Ломбард = ПараметрыСеанса.ТекущийЛомбард;
			Объект.Отделение = ЛБ_ОбщийМодуль.ПолучитьОтделениеЛомбарда(ТекущаяДата(), Объект.Ломбард);
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		Иначе
			Объект.Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
			Объект.Отделение = ЛБ_ОбщийМодуль.ПолучитьОтделениеЛомбарда(ТекущаяДата(), Объект.Ломбард);
			Объект.Ответственный = Пользователи.ТекущийПользователь().Сотрудник;
		КонецЕсли;
		
		Объект.ДатаЗаписи = ТекущаяДата();
		Объект.ДейстующаяТара = Истина;
	КонецЕсли;
	
	УстановитьДоступновсть();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступновсть()
	Если ЗначениеЗаполнено(Параметры.Ключ) И Объект.ДейстующаяТара Тогда
		ЭтаФорма.Доступность = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.Ключ) И НЕ Объект.ДейстующаяТара Тогда
		Элементы.Код.Доступность = Ложь;
		Элементы.Отделение.Доступность = Ложь;
		Элементы.Ломбард.Доступность = Ложь;
		Элементы.Наименование.Доступность = Ложь;
		Элементы.ВесТары.Доступность = Ложь;
		Элементы.ДатаЗаписи.Доступность = Ложь;
		Элементы.Ответственный.Доступность = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) И УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
		Элементы.Ломбард.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Ломбард.ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	ЕстьДействующие = "";
	
	Если НЕ Объект.ДейстующаяТара Тогда
		Ответ = Вопрос("Не указано, что тара действующая.
		|Продолжить запись?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	Иначе
		ЕстьДействующие = ПолучитьДейтствующиюТару(Объект.Ломбард);
		Если ЕстьДействующие.Дуствующая <> Неопределено Тогда
			Ответ = Вопрос("Уже есть действующая тара! При продолжении записи с нее будет снята отметка действующей.
			|Продолжить запись?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
			Ответ = Вопрос("После записи, внесение изменений будет не возможным!
			|Продолжить запись?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
			Если Ответ = КодВозвратаДиалога.Нет Тогда
				Отказ = Истина;
			ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
				
				//Объект.ТолькоПросмотр = Истина;
				
				Если ТипЗнч(ЕстьДействующие) = Тип("Структура") Тогда
					Если ЕстьДействующие.Дуствующая <> Неопределено Тогда
						УбратьСтаруюДействующую(ЕстьДействующие.Ссылка);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Если ТипЗнч(ЕстьДействующие) = Тип("Структура") Тогда
				Если ЕстьДействующие.Дуствующая <> Неопределено Тогда
					УбратьСтаруюДействующую(ЕстьДействующие.Ссылка);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДейтствующиюТару(Ломбард)

	Результат = Новый Структура("Ссылка, Дуствующая");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_Тара.Ссылка КАК Ссылка,
		|	ЛБ_Тара.ДейстующаяТара КАК ДейстующаяТара
		|ИЗ
		|	Справочник.ЛБ_Тара КАК ЛБ_Тара
		|ГДЕ
		|	ЛБ_Тара.Ломбард = &Ломбард
		|	И ЛБ_Тара.ДейстующаяТара = ИСТИНА";
	
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Результат.Ссылка = РезультатЗапроса.Ссылка;
		Результат.Дуствующая = РезультатЗапроса.ДейстующаяТара;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура УбратьСтаруюДействующую(Ссылка)
	СпрОбъект = Ссылка.ПолучитьОбъект();
	СпрОбъект.ДейстующаяТара = Ложь;
	СпрОбъект.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьДоступновсть();
КонецПроцедуры

&НаКлиенте
Процедура ВесТарыПриИзменении(Элемент)
	Если Объект.ВесТары <> 0 Тогда
		Объект.Наименование = "Тара_" + Объект.ВесТары;
	Иначе
		Объект.Наименование = "";
	КонецЕсли;
КонецПроцедуры
